# -*- coding: utf-8 -*-


import os
import redis


def main():
    redis_url = os.environ.get("REDIS_URL")
    redis_conn = redis.from_url(redis_url)
    print("Connected to Redis")
    redis_conn.hset("news", "2015110204", "02.11.2015\n\n📢📢📢 Диққат янгилик!\n\nБот фаолият бошлаганига 1 кун бўлмасдан Маслаҳат.уз гуруҳидаги постларга Телеграм орқали обуна бўлганлар сони 100 нафардан ошди!\n\nАйрим техник носозлик эътибордан четда қолиб, бот гуруҳда муҳокама бўлаётган аввалги постларни ҳам юбораётганди. Энди ботнинг ишлаш алгоритми ўзгартирилиб, фақат шу куннинг ўзида ёзилган янги постлар ҳақида хабарлар юборилади.\n\nБот ҳақида янги таклифларингиз бўлса, @crispybone билан боғланишингиз мумкин.\n\nЭслатма: истаган вақтингизда обунани бекор қилиш учун /stop сўзини юборишингиз мумкин.")
    print("Published to Redis!")

if __name__ == '__main__':
    main()
